[TC_WOTC_MILL_M4C_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>M4</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>M4s</b></font>"
AbilityDescName="assault carbine"
BriefSummary="The M4 is a 5.56x45mm assault rifle that resembles and was the product of the XM177 Commando rifle series. It's actually shorter than the M16A2 rifle, with 80% parts interchangability. The other 20% that's not interchangable is the barrel, gas tube, and the buffer spring, since those parts are drastically altered for the M16A2 to use. Just like the other M16 rifles, the M4 can accept a wide variety of attachments, including those that can mount to a Picatinny rail. The M4 Carbine is a 3-burst variant, unlike its counterpart, the M4A1, a full-auto version of the M4 Carbine, intended for special operations. Most M4 carbines are converted to M4A1s, so you won't see one with a three-burst trigger group very often."
TacticalText="<Bullet/>Type: Assault Carbine\n<Bullet/>Firing Profile: Three-Shot Burst\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.56x45mm NATO\n<Bullet/>Origin: United States\n<Bullet/>Tier: Conventional"

[TC_WOTC_MILL_M4C_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>M4 Custom</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>M4 Customs</b></font>"
AbilityDescName="assault carbine"
BriefSummary="The M4A1 is a 5.56x45mm assault rifle that resembles and was the product of the XM177 Commando rifle series. It's actually shorter than the M16A2 rifle, with 80% parts interchangability. The other 20% that's not interchangable is the barrel, gas tube, and the buffer spring, since those parts are drastically altered for the M16A2 to use. Just like the other M16 rifles, the M4 can accept a wide variety of attachments, including those that can mount to a Picatinny rail. The M4 Carbine, is a 3-burst variant, unlike its counterpart, the M4A1, a full-auto version of the M4 Carbine, intended for special operations. Most M4 carbines are converted to M4A1s, so you won't see one with a three-burst trigger group very often.\n The AEX version refits the gas-operated system with elerium, giving the weapon an edge over its counterpart version. Most of the parts are replaced with a stronger material made from Alien Alloy, to prevent the weapon from warping under extreme conditions."
TacticalText="<Bullet/>Type: Assault Carbine\n<Bullet/>Firing Profile: Three-Shot Burst\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.56x45mm NATO\n<Bullet/>Origin: United States\n<Bullet/>Tier: Magnetic"

[TC_WOTC_MILL_M4C_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>XNV4 Carbine</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>XNV4 Carbines</b></font>"
AbilityDescName="assault carbine"
BriefSummary="The M4A1 is a 5.56x45mm assault rifle that resembles and was the product of the XM177 Commando rifle series. It's actually shorter than the M16A2 rifle, with 80% parts interchangability. The other 20% that's not interchangable is the barrel, gas tube, and the buffer spring, since those parts are drastically altered for the M16A2 to use. Just like the other M16 rifles, the M4 can accept a wide variety of attachments, including those that can mount to a Picatinny rail. The M4 Carbine, is a 3-burst variant, unlike its counterpart, the M4A1, a full-auto version of the M4 Carbine, intended for special operations. Most M4 carbines are converted to M4A1s, so you won't see one with a three-burst trigger group very often.\n The Custom version of the M4 rifle has most of its internal parts stripped out and replaced with Alien Alloy, exponentally increasing its durability and power. The new barrel is embedded with small traces of electromagnetic material, causing the kinetic energy of each bullet to increase tremendously. It's able to puncture the toughest of armors."
TacticalText="<Bullet/>Type: Assault Carbine\n<Bullet/>Firing Profile: Three-Shot Burst\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.56x45mm NATO\n<Bullet/>Origin: United States\n<Bullet/>Tier: Beam"

[TC_WOTC_SKR_MILL_M4C_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>M4</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>M4s</b></font>"
AbilityDescName="assault carbine"
BriefSummary="The M4 is a 5.56x45mm assault rifle that resembles and was the product of the XM177 Commando rifle series. It's actually shorter than the M16A2 rifle, with 80% parts interchangability. The other 20% that's not interchangable is the barrel, gas tube, and the buffer spring, since those parts are drastically altered for the M16A2 to use. Just like the other M16 rifles, the M4 can accept a wide variety of attachments, including those that can mount to a Picatinny rail. The M4 Carbine is a 3-burst variant, unlike its counterpart, the M4A1, a full-auto version of the M4 Carbine, intended for special operations. Most M4 carbines are converted to M4A1s, so you won't see one with a three-burst trigger group very often."
TacticalText="<Bullet/>Type: Assault Carbine\n<Bullet/>Firing Profile: Three-Shot Burst\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.56x45mm NATO\n<Bullet/>Origin: United States\n<Bullet/>Tier: Conventional"

[TC_WOTC_SKR_MILL_M4C_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>M4 Custom</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>M4 Customs</b></font>"
AbilityDescName="assault carbine"
BriefSummary="The M4A1 is a 5.56x45mm assault rifle that resembles and was the product of the XM177 Commando rifle series. It's actually shorter than the M16A2 rifle, with 80% parts interchangability. The other 20% that's not interchangable is the barrel, gas tube, and the buffer spring, since those parts are drastically altered for the M16A2 to use. Just like the other M16 rifles, the M4 can accept a wide variety of attachments, including those that can mount to a Picatinny rail. The M4 Carbine, is a 3-burst variant, unlike its counterpart, the M4A1, a full-auto version of the M4 Carbine, intended for special operations. Most M4 carbines are converted to M4A1s, so you won't see one with a three-burst trigger group very often.\n The AEX version refits the gas-operated system with elerium, giving the weapon an edge over its counterpart version. Most of the parts are replaced with a stronger material made from Alien Alloy, to prevent the weapon from warping under extreme conditions."
TacticalText="<Bullet/>Type: Assault Carbine\n<Bullet/>Firing Profile: Three-Shot Burst\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.56x45mm NATO\n<Bullet/>Origin: United States\n<Bullet/>Tier: Magnetic"

[TC_WOTC_SKR_MILL_M4C_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>XNV4 Carbine</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>XNV4 Carbines</b></font>"
AbilityDescName="assault carbine"
BriefSummary="The M4A1 is a 5.56x45mm assault rifle that resembles and was the product of the XM177 Commando rifle series. It's actually shorter than the M16A2 rifle, with 80% parts interchangability. The other 20% that's not interchangable is the barrel, gas tube, and the buffer spring, since those parts are drastically altered for the M16A2 to use. Just like the other M16 rifles, the M4 can accept a wide variety of attachments, including those that can mount to a Picatinny rail. The M4 Carbine, is a 3-burst variant, unlike its counterpart, the M4A1, a full-auto version of the M4 Carbine, intended for special operations. Most M4 carbines are converted to M4A1s, so you won't see one with a three-burst trigger group very often.\n The Custom version of the M4 rifle has most of its internal parts stripped out and replaced with Alien Alloy, exponentally increasing its durability and power. The new barrel is embedded with small traces of electromagnetic material, causing the kinetic energy of each bullet to increase tremendously. It's able to puncture the toughest of armors."
TacticalText="<Bullet/>Type: Assault Carbine\n<Bullet/>Firing Profile: Three-Shot Burst\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.56x45mm NATO\n<Bullet/>Origin: United States\n<Bullet/>Tier: Beam"